{"majors":[{"name":"Computer Science and Technology", 
            "id":"CSAT",
            "concs":[{"name":"Computer Science",
                      "desc":"The ABET accredited Computer Science concentration includes a broad foundation in the core areas of computer science, including operating systems, computer organization, programming language design, and advanced study of algorithms and theoretical computer science. Technical elective courses provide specialization in two areas chosen by the student.",
                      "courses":[{"name":"ITEC 352" ,
                                  "desc":"Covers relationships among computer components, structures and systems, hardware features, costs, and capabilities."},
                                 {"name":"ITEC 371",
                                  "desc":"Principles of operating systems including interaction between operating systems and architecture of computer systems with emphasis on resource management."},
                                 {"name":"ITEC 420",
                                  "desc":"A survey of attempts to model computation and formal language concepts."}]},
                     {"name":"Database",
                      "desc":"Information is power. As a result, providing for the integrity, security, and availability of data is now a critical task within organizations. The Database concentration educates students in all aspects of data management from database design to database administration to data warehousing and analysis. The concentration also provides an excellent foundation from which to pursue a career in the design and implementation of database management system (DMBS) software.",
                      "courses":[{"name":"ITEC 340",
                                  "desc":"A breadth first introduction to database systems including the relational model, SQL, security, database design, and stored procedures."},
                                 {"name":"ITEC 441",
                                  "desc":"A continuation of the introductory database course covering techniques used to model and manipulate large data sets. Course provides more in-depth coverage of triggers, assertions, PL/SQL, logical design, and normalization. Course introduces physical design of the database management system."},
                                 {"name":"ITEC 442",
                                  "desc":"A continuation of principles of database systems covering techniques for modelling, managing, and analysing large data sets. This course lays the foundation for business intelligence by providing in-depth coverage of data warehousing, data mining, and reporting."}]},
                     {"name":"Software Engineering",
                      "desc":"The Software Engineering concentration is designed to produce designers for large, complex software systems. Current best practices and process models of the software development life cycle are covered with detailed study of all process phases from requirements elicitation through operations and maintenance. Emphasis is on design attributes that make it possible to efficiently implement, extend, and maintain large systems.",
                      "courses":[{"name":"ITEC 370",
                                  "desc":"Introduction to the principles of software engineering and the design and implementation strategies appropriate for large software projects. Includes project planning, specifications of project requirements, architectural design, verification and validation techniques and software maintenance."},
                                 {"name":"ITEC 471",
                                  "desc":"A continuation of principles of software engineering and the design and implementation strategies appropriate for large software projects. Includes the use of CASE tools, extreme programming methods, software metrics, verification, validation, quality assurance, and a further exploration of the principles of human-computer interaction."},
                                 {"name":"ITEC 472",
                                  "desc":"A continuation of principles of software engineering and the design and implementation strategies appropriate for large software projects. This course is intended to provide a large-system capstone experience."}]},
                     {"name":"Networks",
                      "desc":"Computer and communications networks are now a part of our everyday lives. The networks Concentration prepares students for careers in network design and network administration. Courses expose students to a broad spectrum of networking concepts and technologies in both a theoretical classroom setting and an advanced networks lab.",
                      "courses":[{"name":"ITEC 350",
                                  "desc":"This course covers networking concepts including the ISO reference model, TCP/IP protocol, and various network classifications as well as hands-on experience."},
                                 {"name":"ITEC 451",
                                  "desc":"Covers network design and analysis concepts and tools including optimization and traffic engineering."},
                                 {"name":"ITEC 452",
                                  "desc":"Covers analysis and design of distributed systems."}]}]}, 
            {"name":"Information Science and Systems", 
             "id":"ISAS",
		       	 "concs":[{"name":"Information Systems",
                       "desc":"Until 2001 the Information Systems (IS) major at Radford University was housed in the College of Business and Economics.  In 2001 the IS major moved to Radford’s new College of Information Science and Technology where is now one of seven concentrations that students can choose. Despite the relocation, the program remains a cross-disciplinary program with an emphasis in both business and technology.   The program has two primary objectives-- the application of technology to solve business problems and the successful management of information technology within a business organization. To that end, the requirements of the concentration include a mix of courses in both business and information technology taught in both colleges.",
                       "courses":[{"name":"ITEC 281",
                                   "desc":"A study of basic and advanced techniques for data analysis and management using electronic spreadsheets.   Coverage includes the study of features for gathering, managing, manipulating, and filtering data sets including multidimensional data.  Techniques for collaborative use of a spreadsheet are covered including multi-user access, formula protection, and security.  Advanced analysis coverage includes built-in and user defined functions, goal seeking, sensitivity analysis, scenario management, and data visualization."},
                                  {"name":"ITEC 485",
                                   "desc":"Data and modelling solutions to semi-structured business problems including expert systems, executive information systems, on-line analytical processing, natural language interfaces, and ad-hoc query and reporting tools."},
                                  {"name":"ITEC 495",
                                   "desc":"Advanced topics in information systems that build on previous courses in software engineering, web programming, databases and business.  This course is intended to provide a large information system capstone experience."}]},
                      {"name":"Web Development",
                       "desc":"The Web Development concentration is designed to produce professionals with expertise in all aspects of web site development and operation from site aesthetics to systems programming to ecommerce transaction processing. This is a heavily cross-disciplinary concentration with required courses in business, art, media studies, communications, as well as information technology.",
                       "courses":[{"name":"ITEC 225",
                                   "desc":"An introduction to web programming for those students that already understand programming fundamentals.  Includes an introduction to a variety of web based programming languages as well as an introduction to operating system environments that support web applications."},
                                  {"name":"ITEC 325",
                                   "desc":"Continuation of Web Programming I course for tools, methods, and technologies for designing and producing web pages incorporating multimedia content. More basic technologies and tools and methods for designing and managing world wide web programming and development are discussed.  Emphasis is placed on server side scripting applications including 'data-driven' web applications.  Students gain practical experience developing complete “data-driven” web applications using server-side scripts."},
                                  {"name":"ITEC 425",
                                   "desc":"An advanced development class in Web programming for those students that have completed the Web Programming I and II sequence.  Includes the applied study of Web services, asynchronous web programming, web server configuration, web object oriented constructs, and other current topics in Web development."}]}]}]}
